/**
 * 배열
 *  - 자바의 기본 타입 이외에 n개의 데이터를 다루는 자료구조
 *      - (*)배열 -> 아파트형태, 각 호실에 데이터가 존재!!
 *          - 순서가 존재한다 : 0, 1, 2, ...
 *          - 동일한 타입만 맴버로 가질수 있다!!
 *              - 정수 배열 => 정수만
 *              - 문자열 배열 => 문자열
 *              - 배열이 한번 만들어지면 맴버를 추가/삭제등 행위 x
 *              - 고정크기!!, 최초 세팅된 크기가 최종
 *      - 컬렉션 계열
 *          - List
 *          - Map
 *          - Set
 *          - ...
 */
public class Test4 {
    public static void main(String[] args) {
        // 1. 배열 선언 및 초기화
        {
            // 크기 5개짜리 정수형 배열 생성 => 아파트 공사해라
            int[] nums = new int[5]; // 배열 껍대기만 존재, 데이터 x
            // 배열에 데이터 세팅
            nums[0] = 1;
            nums[1] = 2;
            nums[2] = 30;
            nums[3] = 4;
            nums[4] = 5;
            // 출력 for - each
            for (int i: nums) {
                System.out.println(i);
            }
        }
        {
        }
        {
        }
        {
        }
    }
}
