// 패키지 내부에서 클레스 생성 -> 무조건 패키지 표식 자동추가됨
package com.example.demo.basic;
/**
 * 클레스 정의
 * - 클레스 (class)
 *      - 코드로 존재
 *      - 객체를 생성(구현)하기 위한 설계도면(청사진, 붕어빵기계,..., 틀)
 *      - 변수(필드), 메소드(함수), 생성자 로 구성
 *
 * - 객체 (Object)
 *      - 메모리상에 존재
 *      - 클레스를 기반으로 생성 (클레스와 유사하게 생겼음)
 *      - 클레스의 인스턴스가 객체이다 (붕어빵)
 *
 *       *  - 클레스 문법
 *  *  [모디파이어] class 클레스명(첫글자 대문자)
 *  *  [extends 부모클레스명(상속표현)]
 *  *  [implements 인터페이스명(다중상속표현)] <- 클레스 선언부
 *  *  {   <- 클레스 코드블럭
 *  *      맴버 변수
 *  *      맴버 메소드
 *  *      생성자
 *  *      inner class(내부 클레스)
 *  *  }
 */
public class ClassInfo {
    // 메인 메소드
    // J2SE(PC 기반 유저 대상 자바 개발시 사용하는 버전)
    // 반드시 main 메소드가 존재해야 한다 (규칙)
    // 가장 먼저 메모리에 상주, 호출되야 한다(규칙)
    // args : 자바 구동시 전달할 매개 변수가 있다면 받는다
    // 통상적으로는 전달 X
    // main 시작점, 엔트리포인트!!
    public static void main(String[] args) {
    }
}